# PANDAS

First we will cover what series are. Series are similar to numpy arrays, only thing is that they are buit on top of the numpy arrays. Series hold any type of data value and they can be indexed by a label

WE SHALL FIRST LEARN ABOUT SERIES

In [37]:
import numpy as np
import pandas as pd
from numpy.random import randn
from matplotlib import pyplot as plt

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
#In order to Create a series
#pd.Series(data,index)
a = pd.Series(my_list, labels)

In [4]:
a

a    10
b    20
c    30
dtype: int64

In [5]:
#You can also pass in a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
#you can also convert a np array to a series
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [7]:
#You can also pass in the data and index as a list 
ser1 = pd.Series(data=['USA','USSR','UK','Poland'], index='1 2 3 4'.split())

In [8]:
ser1

1       USA
2      USSR
3        UK
4    Poland
dtype: object

In [9]:
#To Call off of the series
#Pass in the index as ''
ser1['2']

'USSR'

# DATA FRAMES

In [10]:
#A dataframe takes five arguments, data, index, column, dtype and copy
#Here we created a dataframe using a dictionary
#In the dictionary, key will be the column and value will the data
#Dataframe can hold any data type
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data, index='A B C D'.split())

In [11]:
df

     Name  Age    Address Qualification
A     Jai   27      Delhi           Msc
B  Princi   24     Kanpur            MA
C  Gaurav   22  Allahabad           MCA
D    Anuj   32    Kannauj           Phd

In [12]:
#You can also select rows and colums off of the data frame
#To call the column
df['Name']

A       Jai
B    Princi
C    Gaurav
D      Anuj
Name: Name, dtype: object

In [13]:
#To call the row
df.loc['A']
#When you use loc[], pass in the exact row name

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: A, dtype: object

In [14]:
df.iloc[2]
#When you use iloc you pass in the index location of that row, i.e, 0,1,2 etc

Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Name: C, dtype: object

In [15]:
#Now lets consider another example
df1 = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [16]:
df1

          W         X         Y         Z
A  0.510290  0.250097 -1.318364 -2.094406
B -0.171632 -1.374132  0.422143 -1.110324
C  0.514478 -0.887068 -0.210982 -0.411337
D -0.169175  1.964628  0.482543  0.558698
E  0.810625  1.640088 -0.036953 -0.104692

In [17]:
df1['W']

A    0.510290
B   -0.171632
C    0.514478
D   -0.169175
E    0.810625
Name: W, dtype: float64

In [18]:
#Two select two columns
#Pass in a list of columns you want to 
df1[['W','Z']]

          W         Z
A  0.510290 -2.094406
B -0.171632 -1.110324
C  0.514478 -0.411337
D -0.169175  0.558698
E  0.810625 -0.104692

In [19]:
df1>0

       W      X      Y      Z
A   True   True  False  False
B  False  False   True  False
C   True  False  False  False
D  False   True   True   True
E   True   True  False  False

In [20]:
#Just like in Numpy, if you want non bool values
df1[df1>0]

          W         X         Y         Z
A  0.510290  0.250097       NaN       NaN
B       NaN       NaN  0.422143       NaN
C  0.514478       NaN       NaN       NaN
D       NaN  1.964628  0.482543  0.558698
E  0.810625  1.640088       NaN       NaN

In [21]:
#To reset the index to 0,1,2.....n
df1.reset_index()

  index         W         X         Y         Z
0     A  0.510290  0.250097 -1.318364 -2.094406
1     B -0.171632 -1.374132  0.422143 -1.110324
2     C  0.514478 -0.887068 -0.210982 -0.411337
3     D -0.169175  1.964628  0.482543  0.558698
4     E  0.810625  1.640088 -0.036953 -0.104692

In [22]:
newindex = 'USA UK GER CAN'.split()
df['States'] = newindex

In [23]:
df

     Name  Age    Address Qualification States
A     Jai   27      Delhi           Msc    USA
B  Princi   24     Kanpur            MA     UK
C  Gaurav   22  Allahabad           MCA    GER
D    Anuj   32    Kannauj           Phd    CAN

NOW WE SHALL LEARN ABOUT MISSING DATA

In [45]:
df2 = pd.DataFrame({'A':[np.nan,2,3],
                  'B':[5,6.0,9],
                  'C':[np.nan,5,3], 'D':[6,7,np.nan]}, index='W X Y'.split())

In [46]:
df2

     A    B    C    D
W  NaN  5.0  NaN  6.0
X  2.0  6.0  5.0  7.0
Y  3.0  9.0  3.0  NaN

In [47]:
#dropna() will drop all the rows with even one NaN value
df2.dropna()

     A    B    C    D
X  2.0  6.0  5.0  7.0

In [48]:
#If you want to drop the columns with NaN values
df2.dropna(axis=1)

     B
W  5.0
X  6.0
Y  9.0

In [49]:
#If you want to drop NaN values selectively 
#This means dropping those rows with a certain number of NaN
df2.dropna(thresh=1)
#This means this operation will drop all rows with more than or equal to one NaN value

     A    B    C    D
W  NaN  5.0  NaN  6.0
X  2.0  6.0  5.0  7.0
Y  3.0  9.0  3.0  NaN

In [50]:
#If you want to fill the NaN values, you can do it by fillna()
#A simple fillna() with a single value will replace all NaN values with the number
df2.fillna(2)

     A    B    C    D
W  2.0  5.0  2.0  6.0
X  2.0  6.0  5.0  7.0
Y  3.0  9.0  3.0  2.0

In [55]:
#You can also enter values For
df2 = df2.fillna(value = df2['A'].mean())

In [56]:
df2

     A    B    C    D
W  2.5  5.0  2.5  6.0
X  2.0  6.0  5.0  7.0
Y  3.0  9.0  3.0  2.5

In [31]:
#To read a CSV file
#import pandas as pd
#df = pd.read_csv('f_name.csv')
#print(df)

In [41]:
new_data = pd.read_csv('cars.csv')
new_data.head()

    mpg   cylinders  cubicinches   hp  weightlbs   time-to-60   year     brand
0  14.0           8          350  165       4209           12   1972       US.
1  31.9           4           89   71       1925           14   1980   Europe.
2  17.0           8          302  140       3449           11   1971       US.
3  15.0           8          400  150       3761           10   1971       US.
4  30.5           4           98   63       2051           17   1978       US.

In [57]:
#You can read several types of files in python using Pandas
#IN jupyter notebook type pd.read
#Hit the tab button in jupyter notebook and it will show several options

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

In [58]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [62]:
new_df = pd.DataFrame(data=data, index='A B C D E F'.split())

In [63]:
new_df

  Company   Person  Sales
A    GOOG      Sam    200
B    GOOG  Charlie    120
C    MSFT      Amy    340
D    MSFT  Vanessa    124
E      FB     Carl    243
F      FB    Sarah    350

In [64]:
#Store it in a variable else it will return the memory location it is stored in 
mycomp = new_df.groupby('Company')

In [65]:
mycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [66]:
mycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [69]:
#You can also instead of passing individual fn, call describe
mycomp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Operations

In [70]:
a = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [71]:
a

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [72]:
#To get unique values
a['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [73]:
#To get the count of unique values
a['col1'].nunique()

4

In [74]:
#To get a count of number of values and their repetitions
a['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [75]:
#For conditional selection
a[a['col1']>=2]

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [76]:
#YOu can also apply custom or inbuilt functions to a column

def squares(x):
    return x**2
a['col1'].apply(squares)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [81]:
#To remove a column
del a['col2']

In [82]:
a

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [87]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [93]:
pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [94]:
#To read a html 
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [96]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"